// Змінні та математичні оператори:
//     Створіть змінну num і присвойте їй значення 10. Створіть другу змінну num2 і присвойте їй значення 5.
//     Використовуючи математичні оператори (+,-,*,/), обчисліть суму, різницю, добуток та частку num та num2. Виведіть результати на екран.
let num1 = 10;
let num2 = 5;
console.log(`Завдання 1:\nСумма: ${num1+num2}\nРізниця: ${num1-num2}\nДобуток: ${num1*num2}\nЧастка: ${num1/num2}`);

// Цикли та масиви:
//     Створіть масив з п`яти чисел. За допомогою циклу for виведіть на екран суму всіх елементів масиву.
let array = [1,2,3,4,5];
let sum = 0;
for (let i = 0; i < array.length; i++) { sum += array[i]; }
console.log(`\nСумма всіх чисел масиву: ${sum}`);

// Функції:
//     Створіть функцію, яка приймає два параметри числа, та повертає їх суму.
//     Викличте функцію з довільними значеннями та виведіть результат на екран.

function func1 (_num1, _num2) { return _num1+_num2; }
console.log(`\nСумма: ${func1(4,9)}`);

// Змінні, цикли та функції:
// //     Створіть функцію, яка приймає один параметр- число n, та повертає масив з першими n числами Фібоначчі.
// //     Використовуючи цикл та функцію, виведіть на екран перші 10 чисел Фібоначчі.

function fibn(length)
{
    let fibn_array = [0,1];
    for (let i = 2; i < length+1; i++){
        let newfibn = fibn_array[i-1] + fibn_array[i-2];
        fibn_array[i] = newfibn;
    }
    return fibn_array;
}
let fibn_array = fibn(10);
console.log(`\nФібоначі числа до 10:`);
for (let i = 0; i < fibn_array.length; i++){
    console.log(`${fibn_array[i]} `)
}